---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures
source: html/e35f48ff-3e49-a71c-fb61-f7f9fa6c4382.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures

Failures about MEP fabrication.

## Syntax (C#)
```csharp
public static class MEPFabricationFailures
```